<a href="https://colab.research.google.com/github/QAtester-MM/Data-Science_Machine-Learning/blob/master/Applied_Predictive_Modeling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import zipfile
with zipfile.ZipFile("/content/it_mlapmldj_01_enus_02.zip", "r") as zipf:
  zipf.extractall("/content/test/")
  zipf.extractall("/content/train/")

In [1]:
import numpy as np
import pandas as pd
from  matplotlib import pyplot as plt
from  matplotlib import style
%matplotlib inline
import seaborn as sns

In [10]:
test_df = pd.read_csv("/content/test/it_mlapmldj_01_enus_02/exploratory_data_analysis/test.csv")
train_df = pd.read_csv("/content/test/it_mlapmldj_01_enus_02/exploratory_data_analysis/train.csv")

In [11]:
##### .info() распечатает краткий обзор данных из нашего датафрейма
train_df.info() #### видим, что по возрасту (п.5) и кабинам (п.10) у нас недостаточно данных (пропущенные данные)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [14]:
train_df.shape  #### видим, что метод .info() гораздо информативнее, чем .shape()

(891, 12)

In [17]:
train_df.describe()    ##### просмотрим краткий статистический обзор данных датафрейма

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [18]:
train_df.head(10) ##### так выглядят первые 10 строк нашего датафрейма, в следующей строке выделим только нкужную нам часть данных

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [19]:
##### выбираем только необходимые колоки и число записей
train_df[["Survived","Pclass","Sex","Age"]][0:5]

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [26]:
##### используя value_counts() определяем количество значений в определенной колонке
train_df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [30]:
##### посчитаем то же самое в процентах с точностью до 2-х знаков после запятой
round(train_df['Sex'].value_counts(normalize=True)*100,2)

male      64.76
female    35.24
Name: Sex, dtype: float64

In [33]:
##### .crosstab() сформирует нам кросс-табличку 2-х (или более) факторов
pd.crosstab(train_df['Sex'], train_df['Survived'])

Survived    0    1
Sex
female     81  233
male      468  109

#Exploratory Data Analysis

In [36]:
total_missing = train_df.isnull().sum().sort_values(ascending=False)
col_pct_missing = round(train_df.isnull().sum()/train_df.isnull().count()*100,1).sort_values(ascending=False)
missing_data = pd.concat([total_missing, col_pct_missing], axis=1, keys = ["Total Missing", "% Missing"])
missing_data.head(7)

          Total Missing  % Missing
Cabin               687       77.1
Age                 177       19.9
Embarked              2        0.2
Fare                  0        0.0
Ticket                0        0.0
Parch                 0        0.0
SibSp                 0        0.0